const bgContent = {
	langSelector: {
		title: "Select Language",
		description: "আপনার পছন্দের ভাষায় অ্যাপ্লিকেশনটি ব্যবহার করুন। নীচের বিকল্পগুলির মধ্যে একটি ভাষা নির্বাচন করুন।",
		continueButtonText: "চালিয়ে যান",
	},
	onboardingData: {
		titles: ["সঠিক নির্ণয়", "ব্যবহারকারী বান্ধব", "বিশেষজ্ঞের পরামর্শ"],
		texts: [
			"আমাদের আধুনিক চিত্র বিশ্লেষণ প্রযুক্তির মাধ্যমে আপনার ফসলের উপর সম্ভাব্য রোগগুলি দ্রুত সনাক্ত করুন।",
			"আপনার ফসলের ছবি সহজেই আপলোড করুন এবং তাৎক্ষণিক ফলাফল পান, যা আপনাকে আপনার খামারের জন্য সময়মত সিদ্ধান্ত নিতে সাহায্য করবে।",
			"বিশেষজ্ঞের পরামর্শ এবং আপনার ফসলের স্বাস্থ্য রক্ষা ও উন্নত করার জন্য কার্যকর পদক্ষেপগুলি পান।",
		],
		joinButtonText: "আন্দোলনে যোগ দিন!",
	},
	homeData: {
		title: "হ্যালো ব্যবহারকারী!",
		description:
			"আজই আমাদের AI-চালিত অ্যাপ দিয়ে আপনার ফসলের স্বাস্থ্য স্ক্যান করুন!",
		guideTexts: ["একটি ছবি তুলুন", "ছবি আপলোড করুন", "সমাধান পান"],
		categoriesTitle: "ফসলের ধরন",
		categories: ["মৌসুমি ফসল", "বাণিজ্যিক ফসল"],
	},
	cameraContent: {
		title: "ক্যামেরা",
		permissionDescription:
			"ক্যামেরা ভিউ দেখানোর জন্য আমাদের আপনার অনুমতির প্রয়োজন",
		permissionButtonText: "অনুমতি দিন",
		description:
			"আপনার ফসলের স্বাস্থ্য বিশ্লেষণ করতে একটি ছবি তুলুন বা গ্যালারি থেকে একটি ছবি বেছে নিন",
		chooseImageText: "গ্যালারি থেকে একটি ছবি বেছে নিন",
		removeImageText: "এই ছবিটি মুছুন",
		cancelRequestText: "অনুরোধ বাতিল করুন",
		analyzeImageText: "এই ছবিটি বিশ্লেষণ করুন",
		cropTypeText: "ফসলের ধরন",
		cropNames: {
			groundnut: "চীনাবাদাম",
			wheat: "গম",
			rice: "চাল",
			corn: "ভুট্টা",
			potato: "আলু",
			sugarcane: "আখ",
			tea: "চা",
			soyabean: "সয়াবিন",
			tomato: "টমেটো",
			cotton: "তুলা",
		},
	},
	resultsContent: {
		title: "ফলাফল",
		confidenceTextPart1: "আমরা ",
		confidenceTextPart2: "% আত্মবিশ্বাসী যে এটি ",
		sectionNamesDisease: [
			"সারাংশ",
			"কিভাবে সনাক্ত করবেন",
			"কিভাবে প্রতিরোধ করবেন",
			"কিভাবে চিকিৎসা করবেন",
		],
		sectionNamesHealthy: [
			"সারাংশ",
			"কিভাবে সনাক্ত করবেন",
			"কিভাবে প্রতিরোধ করবেন",
			"কিভাবে চিকিৎসা করবেন",
		],
	},
};

export default bgContent;
