const hiContent = {
	langSelector: {
		title: "भाषा चुनें",
		description:
			"अपनी पसंदीदा भाषा में ऐप का उपयोग करें। नीचे दिए गए विकल्पों में से एक भाषा चुनें।",
		continueButtonText: "जारी रखें",
	},
	onboardingData: {
		titles: ["सटीक निदान", "उपयोगकर्ता के अनुकूल", "विशेषज्ञ अंतर्दृष्टि"],
		texts: [
			"हमारी अत्याधुनिक छवि विश्लेषण तकनीक से अपनी फसलों पर संभावित रोगों की तुरंत पहचान करें।",
			"अपनी फसलों की तस्वीरें आसानी से अपलोड करें और तुरंत परिणाम प्राप्त करें, जिससे आपको अपने खेत के लिए समय पर निर्णय लेने में मदद मिल सके।",
			"विशेषज्ञ सलाह प्राप्त करें और अपनी फसलों के स्वास्थ्य की सुरक्षा और सुधार के लिए उपयोगी कदम उठाएं।",
		],
		joinButtonText: "आंदोलन में शामिल हों!",
	},
	homeData: {
		title: "नमस्ते उपयोगकर्ता!",
		description:
			"आज ही हमारी AI-संचालित ऐप से अपनी फसलों के स्वास्थ्य की जांच करें!",
		guideTexts: [
			"एक तस्वीर लें",
			"तस्वीर अपलोड करें",
			"समाधान प्राप्त करें",
		],
		categoriesTitle: "फसल श्रेणी",
		categories: ["मौसमी फसलें", "वाणिज्यिक फसलें"],
	},
	cameraContent: {
		title: "कैमरा",
		permissionDescription:
			"हमें कैमरा दृश्य दिखाने के लिए आपकी अनुमति चाहिए",
		permissionButtonText: "अनुमति दें",
		description:
			"अपनी फसलों के स्वास्थ्य का विश्लेषण करने के लिए एक तस्वीर क्लिक करें या गैलरी से एक तस्वीर चुनें",
		chooseImageText: "गैलरी से एक तस्वीर चुनें",
		removeImageText: "इस तस्वीर को हटाएं",
		cancelRequestText: "अनुरोध रद्द करें",
		analyzeImageText: "इस तस्वीर का विश्लेषण करें",
		cropTypeText: "फसल का प्रकार",
		cropNames: {
			groundnut: "मूंगफली",
			wheat: "गेहूं",
			rice: "चावल",
			corn: "मकई",
			potato: "आलू",
			sugarcane: "गन्ना",
			tea: "चाय",
			soyabean: "सोयाबीन",
			tomato: "टमाटर",
			cotton: "कपास",
		},
	},
	resultsContent: {
		title: "परिणाम",
		confidenceTextPart1: "हमें ",
		confidenceTextPart2: "% विश्वास है कि यह है ",
		sectionNames: [
			"सारांश",
			"कैसे पहचानें",
			"कैसे रोकें",
			"कैसे इलाज करें",
		],
	},
};

export default hiContent;
