const knContent = {
  onboardingData: {
    titles: ["ಸರಿಯಾದ ರೋಗಪರಿಚಯ", "ಬಳಕೆದಾರ ಸ್ನೇಹಿ", "ತಜ್ಞರ ಸಲಹೆಗಳು"],
    texts: [
      "ನಮ್ಮ ಅತ್ಯಾಧುನಿಕ ಚಿತ್ರ ವಿಶ್ಲೇಷಣೆ ತಂತ್ರಜ್ಞಾನದ ಮೂಲಕ ನಿಮ್ಮ ಬೆಳೆಗಳಿಗೆ ಬರುವ ಸಾಧ್ಯವಿರುವ ರೋಗಗಳನ್ನು ತಕ್ಷಣವೇ ಗುರುತಿಸಿ.",
      "ನಿಮ್ಮ ಬೆಳೆಗಳ ಚಿತ್ರಗಳನ್ನು ಸುಲಭವಾಗಿ ಅಪ್ಲೋಡ್ ಮಾಡಿ ಮತ್ತು ತಕ್ಷಣದ ಫಲಿತಾಂಶಗಳನ್ನು ಪಡೆಯಿರಿ, ಇದು ನಿಮಗೆ ನಿಮ್ಮ ಹೊಲದ ಸಮಯಸಮುದಾಯ ನಿರ್ಣಯಗಳನ್ನು ಕೈಗೊಳ್ಳಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.",
      "ತಜ್ಞರ ಸಲಹೆಗಳನ್ನು ಪಡೆದುಕೊಳ್ಳಿ ಮತ್ತು ನಿಮ್ಮ ಬೆಳೆಗಳ ಆರೋಗ್ಯವನ್ನು ಸುರಕ್ಷಿತ ಮತ್ತು ಸುಧಾರಿಸಲು ಕ್ರಮಗಳನ್ನು ಕೈಗೊಳ್ಳಿ.",
    ],
    joinButtonText: "ಚಲುವಳಿಗೆ ಸೇರಿಕೊಳ್ಳಿ!",
  },
  homeData: {
    title: "ನಮಸ್ಕಾರ ಬಳಕೆದಾರ!",
    description:
      "ನಮದ AI-ಚಾಲಿತ ಅಪ್ಲಿಕೇಶನ್‌ನೊಂದಿಗೆ ಇಂದು ನಿಮ್ಮ ಬೆಳೆಗಳ ಆರೋಗ್ಯವನ್ನು ಪರಿಶೀಲಿಸಿ!",
    guideTexts: [
      "ಚಿತ್ರ ತೆಗೆದುಕೊಳ್ಳಿ",
      "ಚಿತ್ರವನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ",
      "ಹುಡುಕಾಟ ಪರಿಹಾರ",
    ],
    categoriesTitle: "ಬೆಳೆ ವರ್ಗ",
    categories: ["ಹಂಗಾಮಿಯ ಬೆಳೆಗಳು", "ವಾಣಿಜ್ಯ ಬೆಳೆಗಳು"],
  },
  cameraContent: {
    title: "ಕ್ಯಾಮೆರಾ",
    permissionDescription:
      "ಕ್ಯಾಮೆರಾ ವೀಕ್ಷಣೆಯನ್ನು ತೋರಿಸಲು ನಿಮ್ಮ ಅನುಮತಿಯನ್ನು ನಮಗೆ ಬೇಕಾಗಿದೆ",
    permissionButtonText: "ಅನುಮತಿಯನ್ನು ನೀಡಿ",
    description:
      "ನಿಮ್ಮ ಬೆಳೆಗಳ ಆರೋಗ್ಯವನ್ನು ವಿಶ್ಲೇಷಿಸಲು ಚಿತ್ರವನ್ನು ಕ್ಲಿಕ್ ಮಾಡಿ ಅಥವಾ ಗ್ಯಾಲರಿಯಿಂದ ಚಿತ್ರವನ್ನು ಆಯ್ಕೆಮಾಡಿ",
    chooseImageText: "ಗ್ಯಾಲರಿಯಿಂದ ಚಿತ್ರವನ್ನು ಆಯ್ಕೆಮಾಡಿ",
    removeImageText: "ಈ ಚಿತ್ರವನ್ನು ತೆಗೆಯಿರಿ",
    cancelRequestText: "ವಿನಂತಿಯನ್ನು ರದ್ದುಮಾಡಿ",
    analyzeImageText: "ಈ ಚಿತ್ರವನ್ನು ವಿಶ್ಲೇಷಿಸಿ",
    cropTypeText: "ಬೆಳೆ ಪ್ರಕಾರ",
    cropNames: {
      groundnut: "ಶೇಂಗ",
      wheat: "ಗೋಧಿ",
      rice: "ಅಕ್ಕಿ",
      corn: "ಮೆಕ್ಕೆಜೋಳ",
      potato: "ಅಲೂಗಡ್ಡೆ",
      sugarcane: "ಕಬ್ಬು",
      tea: "ಚಹಾ",
      soyabean: "ಸೊಯಾಬೀನ್",
      tomato: "ಟೊಮೇಟೊ",
      cotton: "ಹತ್ತಿ",
    },
  },
  resultsContent: {
    title: "ಫಲಿತಾಂಶಗಳು",
    confidenceTextPart1: "ನಮಗೆ ",
    confidenceTextPart2: "% ನಂಬಿಕೆ ಇದೆ ಇದು ",
    sectionNames: [
      "ಸಾರಾಂಶ",
      "ಹೆಚಣೆಯಾದರೂ ಹೇಗೆ?",
      "ತಡೆಗಟ್ಟುವುದು ಹೇಗೆ?",
      "ಚಿಕಿತ್ಸೆಯನ್ನು ಹೇಗೆ ಮಾಡುವುದು?",
    ],
  },
};

export default knContent;
