const maContent = {
  onboardingData: {
    titles: ["योग्य निदान", "वापरकर्ता अनुकूल", "तज्ञांच्या सल्ल्या"],
    texts: [
      "आमच्या अत्याधुनिक प्रतिमा विश्लेषण तंत्रज्ञानासह आपल्या पिकांवर येणाऱ्या संभाव्य रोगांची त्वरित ओळख करा.",
      "आपल्या पिकांच्या प्रतिमा सहजपणे अपलोड करा आणि तत्काळ परिणाम मिळवा, जे आपल्याला शेतासाठी वेळेवर निर्णय घेण्यास मदत करेल.",
      "तज्ञांच्या सल्ल्या मिळवा आणि आपल्या पिकांच्या आरोग्याची सुरक्षा आणि सुधारण्यासाठी कृती करा.",
    ],
    joinButtonText: "आंदोलनात सामील व्हा!",
  },
  homeData: {
    title: "नमस्कार वापरकर्ता!",
    description:
      "आजच आमच्या AI-संचालित अॅपसह आपल्या पिकांच्या आरोग्याची तपासणी करा!",
    guideTexts: ["चित्र काढा", "चित्र अपलोड करा", "समाधान मिळवा"],
    categoriesTitle: "पिकांचा प्रकार",
    categories: ["हंगामी पिके", "व्यावसायिक पिके"],
  },
  cameraContent: {
    title: "कॅमेरा",
    permissionDescription:
      "कॅमेरा दृश्य दाखवण्यासाठी आम्हाला आपली परवानगी आवश्यक आहे",
    permissionButtonText: "परवानगी द्या",
    description:
      "आपल्या पिकांच्या आरोग्याचे विश्लेषण करण्यासाठी एक चित्र क्लिक करा किंवा गॅलरीतून चित्र निवडा",
    chooseImageText: "गॅलरीतून चित्र निवडा",
    removeImageText: "हे चित्र काढा",
    cancelRequestText: "विनंती रद्द करा",
    analyzeImageText: "हे चित्र विश्लेषण करा",
    cropTypeText: "पिकांचा प्रकार",
    cropNames: {
      groundnut: "शेंगदाणे",
      wheat: "गहू",
      rice: "तांदूळ",
      corn: "मका",
      potato: "बटाटा",
      sugarcane: "ऊस",
      tea: "चहा",
      soyabean: "सोयाबीन",
      tomato: "टोमॅटो",
      cotton: "कापूस",
    },
  },
  resultsContent: {
    title: "निकाल",
    confidenceTextPart1: "आम्हाला ",
    confidenceTextPart2: "% खात्री आहे की हे ",
    sectionNames: [
      "सारांश",
      "ओळख कशी करावी",
      "प्रतिबंध कसा करावा",
      "उपचार कसा करावा",
    ],
  },
};

export default maContent;
