const mlContent = {
	langSelector: {
		title: "ഭാഷ തിരഞ്ഞെടുക്കുക",
		description:
			"നിങ്ങളുടെ പ്രിയഭാഷയിൽ ആപ്പ് ഉപയോഗിക്കുക. താഴെ നിന്നുള്ള വികല്പങ്ങളിൽ ഒരു ഭാഷ തിരഞ്ഞെടുക്കുക",
		continueButtonText: "തുടരുക",
	},
	onboardingData: {
		titles: [
			"സൂക്ഷ്മ രോഗനിർണ്ണയം",
			"ഉപയോക്തൃ-സൗഹൃദം",
			"വിദഗ്ധ നിർദ്ദേശങ്ങൾ",
		],
		texts: [
			"നമ്മുടെ ആധുനിക ചിത്രം വിശകലന സാങ്കേതികവിദ്യ ഉപയോഗിച്ച് നിങ്ങളുടെ വിളകളെ ബാധിക്കുന്ന സാധ്യതയുള്ള രോഗങ്ങളെ വേഗത്തിൽ തിരിച്ചറിയുക.",
			"നിങ്ങളുടെ വിളകളുടെ ചിത്രങ്ങൾ എളുപ്പത്തിൽ അപ്ലോഡ് ചെയ്യുക, സമയബന്ധിതമായ തീരുമാനങ്ങൾ എടുക്കാൻ സഹായിക്കുന്ന ഫലങ്ങൾ ഉടൻ ലഭിക്കുക.",
			"വിദഗ്ധരിൽ നിന്ന് നിർദ്ദേശങ്ങൾ സ്വീകരിക്കുകയും നിങ്ങളുടെ വിളകളുടെ ആരോഗ്യം സംരക്ഷിക്കാൻ സമാനമായ നടപടികൾ സ്വീകരിക്കുക.",
		],
		joinButtonText: "പ്രസ്ഥാനത്തിൽ ചേരൂ!",
	},
	homeData: {
		title: "ഹലോ ഉപയോക്താവ്!",
		description:
			"ഇന്നുതന്നെ ഞങ്ങളുടെ AI-ചാലിപ്പിക്കുന്ന ആപ്പുമായി നിങ്ങളുടെ വിളകളുടെ ആരോഗ്യനില പരിശോധിക്കുക!",
		guideTexts: [
			"ഒരു ചിത്രം എടുക്കുക",
			"ചിത്രം അപ്ലോഡ് ചെയ്യുക",
			"പരിഹാരം കണ്ടെത്തുക",
		],
		categoriesTitle: "വിളകളുടെ വിഭാഗം",
		categories: ["കാലാവസ്ഥാ വിളകൾ", "വാണിജ്യ വിളകൾ"],
	},
	cameraContent: {
		title: "ക്യാമറ",
		permissionDescription:
			"ക്യാമറ ദൃശ്യങ്ങൾ കാണാൻ നിങ്ങളുടെയൊരു അനുമതി വേണം",
		permissionButtonText: "അനുമതി നൽകുക",
		description:
			"നിങ്ങളുടെ വിളകളുടെ ആരോഗ്യനില വിശകലനം ചെയ്യാൻ ഒരു ചിത്രം എടുക്കുക അല്ലെങ്കിൽ ഗാലറിയിൽ നിന്ന് ഒരു ചിത്രം തിരഞ്ഞെടുക്കുക",
		chooseImageText: "ഗാലറിയിൽ നിന്ന് ഒരു ചിത്രം തിരഞ്ഞെടുക്കുക",
		removeImageText: "ഈ ചിത്രം നീക്കംചെയ്യുക",
		cancelRequestText: "അഭ്യർത്ഥന റദ്ദാക്കുക",
		analyzeImageText: "ഈ ചിത്രം വിശകലനം ചെയ്യുക",
		cropTypeText: "വിളയുടെ തരം",
		cropNames: {
			groundnut: "നെല്ലിക്ക",
			wheat: "ഗോതമ്പ്",
			rice: "അരി",
			corn: "ചോളം",
			potato: "ഉരുളക്കിഴങ്ങ്",
			sugarcane: "കരിമ്പ്",
			tea: "ചായ",
			soyabean: "സോയാബീൻ",
			tomato: "തക്കാളി",
			cotton: "കപ്പാസ്",
		},
	},
	resultsContent: {
		title: "ഫലങ്ങൾ",
		confidenceTextPart1: "നമുക്ക് ",
		confidenceTextPart2: "% വിശ്വാസം ഈ ",
		sectionNamesDisease: [
			"സംക്ഷിപ്തം",
			"എങ്ങനെ തിരിച്ചറിയാം",
			"എങ്ങനെ പ്രതിരോധിക്കാം",
			"എങ്ങനെ ചികിത്സിക്കാം",
		],
		sectionNamesHealthy: [
			"സംക്ഷിപ്തം",
			"എങ്ങനെ തിരിച്ചറിയാം",
			"എങ്ങനെ പ്രതിരോധിക്കാം",
			"എങ്ങനെ ചികിത്സിക്കാം",
		],
	},
};

export default mlContent;
