const odContent = {
	langSelector: {
		title: "ଭାଷା ଚୟନ କରନ୍ତୁ",
		description:
			"ଆପଣଙ୍କ ପସନ୍ଦିତ ଭାଷାରେ ଆପ୍ଲିକେସନ୍ ବ୍ୟବହାର କରନ୍ତୁ। ନିଚେ ଦିଆଯାଇଥିବା ବିକଳ୍ପଗୁଡ଼ିକରୁପରେ ଏକ ଭାଷା ବାଛନା କରନ୍ତୁ।",
		continueButtonText: "ଜାରି ରଖନ୍ତୁ",
	},
	onboardingData: {
		titles: ["ଠିକ୍ ରୋଗ ଚିହ୍ନଟ", "ବ୍ୟବହାରକାରୀ-ମୂଖ୍ୟ", "ନିପୁଣ ପରାମର୍ଶ"],
		texts: [
			"ଆମର ଆଧୁନିକ ଛବି ବିଶ୍ଲେଷଣ ଟେକ୍ନୋଲଜି ସହିତ ଆପଣଙ୍କ ଫସଲରେ ଥିବା ସମ୍ଭାବ୍ୟ ରୋଗଗୁଡ଼ିକୁ ଶୀଘ୍ର ଚିହ୍ନଟ କରନ୍ତୁ।",
			"ଆପଣଙ୍କ ଫସଲର ଛବିଗୁଡ଼ିକୁ ସହଜରେ ଅପଲୋଡ୍ କରନ୍ତୁ ଏବଂ ତତ୍କ୍ଷଣାତ୍ ଫଳାଫଳ ପାଉନ୍ତୁ, ଯାହା ଆପଣଙ୍କୁ ଆପଣଙ୍କର କ୍ଷେତ୍ର ପାଇଁ ସମୟ ସମୟରେ ସଠିକ୍ ନିଷ୍ପତ୍ତି ନେବାରେ ସହାୟକ ହେବ।",
			"ନିପୁଣ ପରାମର୍ଶ ଆଣନ୍ତୁ ଏବଂ ଆପଣଙ୍କର ଫସଲର ସ୍ବାସ୍ଥ୍ୟକୁ ସୁରକ୍ଷା କରିବା ଏବଂ ସଂରକ୍ଷିତ କରିବା ପାଇଁ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।",
		],
		joinButtonText: "ଆନ୍ଦୋଳନରେ ଯୋଗ ଦିଅନ୍ତୁ!",
	},
	homeData: {
		title: "ନମସ୍କାର ବ୍ୟବହାରକାରୀ!",
		description:
			"ଆଜି ବେଳେ ଆମର AI-ଓଡ଼ାଯାଇଥିବା ଏପ୍‌ରେ ଆପଣଙ୍କର ଫସଲର ସ୍ବାସ୍ଥ୍ୟ ପରୀକ୍ଷା କରନ୍ତୁ!",
		guideTexts: ["ଛବି ନେବା", "ଛବି ଅପଲୋଡ୍ କରନ୍ତୁ", "ଏକ ସମାଧାନ ପାଉନ୍ତୁ"],
		categoriesTitle: "ଫସଲ ବିଭାଗ",
		categories: ["ମୌସମୀ ଫସଲ", "ବାଣିଜ୍ୟିକ ଫସଲ"],
	},
	cameraContent: {
		title: "କ୍ୟାମେରା",
		permissionDescription:
			"କ୍ୟାମେରା ଭିଜୁଆଲ ଦେଖିବାକୁ ଆମକୁ ଆପଣଙ୍କର ଅନୁମତି ଆବଶ୍ୟକ |",
		permissionButtonText: "ଅନୁମତି ଦିଅନ୍ତୁ",
		description:
			"ଆପଣଙ୍କର ଫସଲର ସ୍ବାସ୍ଥ୍ୟ ବିଶ୍ଲେଷଣ କରିବାକୁ ଛବି ନେବା କିମ୍ବା ଗ୍ୟାଲେରୀରୁ ଛବି ବାଛନ୍ତୁ",
		chooseImageText: "ଗ୍ୟାଲେରୀରୁ ଛବି ବାଛନ୍ତୁ",
		removeImageText: "ଏହି ଛବିକୁ ଅପସାରଣ କରନ୍ତୁ",
		cancelRequestText: "ଅନୁରୋଧ ରଦ୍ଦ କରନ୍ତୁ",
		analyzeImageText: "ଏହି ଛବିକୁ ବିଶ୍ଲେଷଣ କରନ୍ତୁ",
		cropTypeText: "ଫସଲ ପ୍ରକାର",
		cropNames: {
			groundnut: "ବଦାମ",
			wheat: "ଗହମ",
			rice: "ଚାଉଳ",
			corn: "ମକା",
			potato: "ଆଳୁ",
			sugarcane: "ଖାରା",
			tea: "ଚା",
			soyabean: "ସୋଯାବିନ",
			tomato: "ଟମାଟୋ",
			cotton: "ପଟି",
		},
	},
	resultsContent: {
		title: "ଫଳାଫଳ",
		confidenceTextPart1: "ଆମେ ",
		confidenceTextPart2: "% ନିଶ୍ଚିତ ଅଛୁଅହାଁ",
		sectionNamesDisease: [
			"ସଂକ୍ଷେପ",
			"କିପରି ଚିହ୍ନଟ କରିବେ",
			"କିପରି ରୋକିବେ",
			"କିପରି ଚିକିତ୍ସା କରିବେ",
		],
		sectionNamesHealthy: [
			"ସଂକ୍ଷେପ",
			"କିପରି ଚିହ୍ନଟ କରିବେ",
			"କିପରି ରୋକିବେ",
			"କିପରି ଚିକିତ୍ସା କରିବେ",
		],
	},
};

export default odContent;
