const tlContent = {
	langSelector: {
		title: "భాషను ఎంచుకోండి",
		description:
			"మీ ఇష్టమైన భాషలో యాప్ ను ఉపయోగించండి. క్రింది ఎంపికల నుండి భాషను ఎంచుకోండి.",
		continueButtonText: "కొనసాగండి",
	},
	onboardingData: {
		titles: ["సక్రమ నిర్ధారణ", "వినియోగదారు స్నేహపూర్వక", "నిపుణుల సలహాలు"],
		texts: [
			"మా అత్యాధునిక చిత్ర విశ్లేషణ సాంకేతికతతో మీ పంటలపై ప్రభావితమవుతున్న వ్యాధులను తక్షణమే గుర్తించండి.",
			"మీ పంటల చిత్రాలను సులభంగా అప్లోడ్ చేసి, వెంటనే ఫలితాలు పొందండి, తద్వారా మీ వ్యవసాయానికి సమయానుకూలమైన నిర్ణయాలు తీసుకోవడానికి సహాయపడుతుంది.",
			"నిపుణుల సలహాలు మరియు మీ పంటల ఆరోగ్యాన్ని రక్షించి మెరుగుపరచడానికి చర్యలు తీసుకోండి.",
		],
		joinButtonText: "చలనం లో చేరండి!",
	},
	homeData: {
		title: "హలో వినియోగదారు!",
		description:
			"ఈ రోజు మా AI-పవర్ చేసిన యాప్ తో మీ పంటల ఆరోగ్యాన్ని స్కాన్ చేయండి!",
		guideTexts: [
			"చిత్రాన్ని తీసుకోండి",
			"చిత్రాన్ని అప్లోడ్ చేయండి",
			"పరిష్కారం పొందండి",
		],
		categoriesTitle: "పంట వర్గం",
		categories: ["సీజనల్ పంటలు", "వాణిజ్య పంటలు"],
	},
	cameraContent: {
		title: "క్యామెరా",
		permissionDescription: "క్యామెరా వీక్షణను చూపించడానికి మీ అనుమతి అవసరం",
		permissionButtonText: "అనుమతి ఇవ్వండి",
		description:
			"మీ పంటల ఆరోగ్యాన్ని విశ్లేషించడానికి చిత్రాన్ని క్లిక్ చేయండి లేదా గ్యాలరీ నుండి చిత్రాన్ని ఎంచుకోండి",
		chooseImageText: "గ్యాలరీ నుండి చిత్రాన్ని ఎంచుకోండి",
		removeImageText: "ఈ చిత్రాన్ని తొలగించండి",
		cancelRequestText: "అభ్యర్థనను రద్దు చేయండి",
		analyzeImageText: "ఈ చిత్రాన్ని విశ్లేషించండి",
		cropTypeText: "పంట రకం",
		cropNames: {
			groundnut: "పల్లీలు",
			wheat: "గోధుమలు",
			rice: "బియ్యం",
			corn: "మొక్కజొన్న",
			potato: "బంగాళాదుంప",
			sugarcane: "చెరుకు",
			tea: "టీ",
			soyabean: "సోయాబీన్",
			tomato: "టమాటో",
			cotton: "పత్తి",
		},
	},
	resultsContent: {
		title: "ఫలితాలు",
		confidenceTextPart1: "మాకు ",
		confidenceTextPart2: "% నమ్మకంగా ఉంది ఇది ",
		sectionNames: [
			"సారాంశం",
			"ఎలా గుర్తించాలి",
			"ఎలా నివారించాలి",
			"ఎలా చికిత్స చేయాలి",
		],
	},
};

export default tlContent;
