const tmContent = {
	langSelector: {
		title: "மொழியை தேர்ந்தெடுக்கவும்",
		description:
			"உங்கள் விருப்பமான மொழியில் பயன்படுத்தவும். கீழே உள்ள விருப்பங்களிலிருந்து ஒரு மொழியைத் தேர்ந்தெடுக்கவும்.",
		continueButtonText: "தொடரு",
	},
	onboardingData: {
		titles: ["சரியான கண்டறிதல்", "பயனர் நட்பு", "நிபுணரின் ஆலோசனை"],
		texts: [
			"எங்கள் நவீன படப்பிடிப்பு தொழில்நுட்பத்தைப் பயன்படுத்தி உங்கள் பயிர்களில் இருக்கும் சாத்தியமான நோய்களை உடனடியாக கண்டறியுங்கள்.",
			"உங்கள் பயிர்களின் படங்களை எளிதில் பதிவேற்றுங்கள் மற்றும் உடனடி முடிவுகளைப் பெறுங்கள், இதனால் உங்கள் பண்ணைக்கு நேரத்தில் முடிவுகளை எடுக்க உதவுகிறது.",
			"நிபுணர்களின் ஆலோசனைகள் மற்றும் உங்கள் பயிர்களின் ஆரோக்கியத்தைப் பாதுகாக்கவும் மேம்படுத்தவும் செயல்பாடுகளைப் பெறுங்கள்.",
		],
		joinButtonText: "நடவடிக்கையில் சேருங்கள்!",
	},
	homeData: {
		title: "வணக்கம் பயனர்!",
		description:
			"இன்றே எங்கள் AI இயக்கப்பட்ட செயலி மூலம் உங்கள் பயிர்களின் ஆரோக்கியத்தை சரிபாருங்கள்!",
		guideTexts: ["படத்தை எடு", "படத்தை பதிவேற்று", "தீர்வு பெறுங்கள்"],
		categoriesTitle: "பயிர் வகை",
		categories: ["பருவநிலைப் பயிர்கள்", "வணிக பயிர்கள்"],
	},
	cameraContent: {
		title: "கேமரா",
		permissionDescription:
			"கேமரா பார்வையை காட்ட உங்கள் அனுமதி தேவையாக உள்ளது",
		permissionButtonText: "அனுமதி வழங்கவும்",
		description:
			"உங்கள் பயிர்களின் ஆரோக்கியத்தைப் பரிசோதிக்க படத்தை எடுக்கவும் அல்லது கேலரியில் இருந்து படத்தைத் தேர்ந்தெடுக்கவும்",
		chooseImageText: "கேலரியில் இருந்து படத்தைத் தேர்ந்தெடுக்கவும்",
		removeImageText: "இந்த படத்தை நீக்கவும்",
		cancelRequestText: "கோரிக்கையை ரத்து செய்யவும்",
		analyzeImageText: "இந்த படத்தை பகுப்பாய்வு செய்யவும்",
		cropTypeText: "பயிர் வகை",
		cropNames: {
			groundnut: "நிலக்கடலை",
			wheat: "கோதுமை",
			rice: "அரிசி",
			corn: "மக்சீ",
			potato: "உருளைக்கிழங்கு",
			sugarcane: "கரும்பு",
			tea: "தேநீர்",
			soyabean: "சோயாபீன்",
			tomato: "தக்காளி",
			cotton: "பருத்தி",
		},
	},
	resultsContent: {
		title: "முடிவுகள்",
		confidenceTextPart1: "நாங்கள் ",
		confidenceTextPart2: "% நம்பிக்கையுடன் கூறுகிறோம் இது ",
		sectionNames: [
			"சுருக்கம்",
			"எப்படி அடையாளம் காண்பது",
			"எப்படி தடுப்பது",
			"எப்படி சிகிச்சையளிக்கலாம்",
		],
	},
};

export default tmContent;
